package org.example.votekg.model;

public enum District {
    // Баткенская область
    LEILEK,           // (#1, районный центр — Раззаков)
    BATKEN,           // (#2, районный центр — Баткен)
    KADAMJAY,         // (#3, районный центр — Кадамжай)

    // Ошская область
    CHON_ALAY,        // (#4, районный центр — Дароот-Коргон)
    NOOKAT,           // (#5, районный центр — Ноокат)
    ARAVAN,           // (#6, районный центр — Араван)
    KARA_SUU,         // (#7, районный центр — Кара-Суу)
    ALAY,             // (#8, районный центр — Гульча)
    UZGEN,            // (#9, районный центр — Узген)
    KARA_KULDJA,      // (#10, районный центр — Кара-Кульджа)

    // Джалал-Абадская область
    SUZAK,            // (#11, районный центр — Сузак)
    BAZAR_KORGON,     // (#12, районный центр — Базар-Коргон)
    NOOKEN,           // (#13, районный центр — Массы)
    AKSY,             // (#14, районный центр — Кербен)
    ALA_BUKA,         // (#15, районный центр — Ала-Бука)
    CHATKAL,          // (#16, районный центр — Каныш-Кыя)
    TOKTOGUL,         // (#17, районный центр — Токтогул)
    TOGUZ_TORO,       // (#18, районный центр — Казарман)

    // Таласская область
    AITMATOV,         // (#19, районный центр — Кызыл-Адыр)
    BAKAI_ATA,        // (#20, районный центр — Бакай-Ата)
    MANAS_TALAS,      // (#21, районный центр — Семетей)
    TALAS,            // (#22, районный центр — Манас)

    // Чуйская область
    PANFILOV,         // (#23, районный центр — Каиңды)
    JAIYL,            // (#24, районный центр — Кара-Балта)
    MOSKVA,           // (#25, районный центр — Беловодское)
    SOKULUK,          // (#26, районный центр — Сокулук)
    ALAMUDUN,         // (#27, районный центр — Лебединовка)
    YSYK_ATA,         // (#28, районный центр — Кант)
    CHUY,             // (#29, районный центр — Токмок)
    KEMIN,            // (#30, районный центр — Кемин)

    // Нарынская область
    JUMGAL,           // (#31, районный центр — Чаек)
    KOCHKOR,          // (#32, районный центр — Кочкорка)
    AK_TAL,           // (#33, районный центр — Баетово)
    NARYN,            // (#34, районный центр — Нарын)
    AT_BASHY,         // (#35, районный центр — Ат-Баши)

    // Иссык-Кульская область
    ISSYK_KUL,        // (#36, районный центр — Чолпон-Ата)
    TYUP,             // (#37, районный центр — Тюп)
    TON,              // (#38, районный центр — Боконбаево)
    JETI_OGUZ,        // (#39, районный центр — Кызыл-Суу)
    AK_SUU            // (#40, районный центр — Ак-Суу)
}
